import random
from time import time, sleep



surnames = [
    "Абрамов", "Агафонов", "Аксенов", "Алехин", "Анисимов",
    "Артамонов", "Баранов", "Белоусов", "Бирюков", "Бобров",
    "Большаков", "Борисов", "Буров", "Васильев", "Веселов",
    "Виноградов", "Вишневский", "Волков", "Воронцов", "Гаврилов",
    "Галкин", "Герасимов", "Голубев", "Гордеев", "Горшков",
    "Грибов", "Гришин", "Громов", "Данилов", "Дементьев",
    "Денисов", "Дмитриев", "Дорофеев", "Дроздов", "Евдокимов",
    "Егоров", "Елисеев", "Ершов", "Жданов", "Жуков",
    "Зайцев", "Захаров", "Зимин", "Зиновьев", "Зубков",
    "Игнатьев", "Ильин", "Карпов", "Кириллов", "Князев"
]

names = [
    "Алексей", "Анатолий", "Антон", "Аркадий", "Арсений",
    "Богдан", "Борис", "Вадим", "Валентин", "Валерий",
    "Василий", "Виктор", "Виталий", "Владислав", "Всеволод",
    "Геннадий", "Георгий", "Глеб", "Григорий", "Денис",
    "Евгений", "Егор", "Игорь", "Кирилл", "Константин",
    "Леонид", "Максим", "Матвей", "Мирослав", "Никита",
    "Олег", "Павел", "Петр", "Платон", "Прохор",
    "Роман", "Ростислав", "Руслан", "Савелий", "Семен",
    "Станислав", "Степан", "Тимофей", "Федор", "Филипп",
    "Эдуард", "Юрий", "Яков", "Ян", "Ярослав"
]

patronymics = [
    "Алексеевич", "Анатольевич", "Андреевич", "Антонович", "Аркадьевич",
    "Арсеньевич", "Борисович", "Вадимович", "Валентинович", "Валерьевич",
    "Васильевич", "Викторович", "Витальевич", "Владимирович", "Владиславович",
    "Всеволодович", "Геннадьевич", "Георгиевич", "Григорьевич", "Денисович",
    "Евгеньевич", "Егорович", "Игоревич", "Ильич", "Кириллович",
    "Константинович", "Леонидович", "Максимович", "Матвеевич", "Михайлович",
    "Никитич", "Николаевич", "Олегович", "Павлович", "Петрович",
    "Романович", "Ростиславович", "Русланович", "Савельевич", "Семенович",
    "Сергеевич", "Станиславович", "Степанович", "Тимофеевич", "Федорович",
    "Филиппович", "Эдуардович", "Юрьевич", "Яковлевич", "Ярославович"
]

def gen(names: list = names, surnames: list = surnames, patronymics: list = patronymics) -> dict:
    name = random.choice(names)
    sname = random.choice(surnames)
    mname = random.choice(patronymics)
    phone = f"+7{random.randint(9100000000, 9199999999)}"
    tnum = random.randint(10000,99999)
    pnum = random.randint(1000,9999)
    onum = random.randint(10000000,99999999)
    track = f"{random.randint(10000000,99999999)}-{random.randint(1000,9999)}-{random.randint(0,9)}"
    
    form = {
        "Фамилия": sname,
        "Имя": name,
        "Отчество": mname,
        "Номер": phone,
        "Табельный номер": tnum,
        "Номер посылки": pnum,
        "Номер оформления": onum,
        "Трек номер": track
    } 
    
    return form

def printable(form: dict) -> any:
    index = -1
    for key, value in form.items():
        index += 1
        if index % 3 == 0: 
            print(f"\n{key}: {value}")
        else:
            print(f"{key}: {value}")
            
def main():
    print("JESUS FAKER v0.1 started!")
    start = time()
    form = gen()
    printable(form)
    end = time()
    full_time = end - start
    input(f"\nВремя генерации: {full_time:.2f}s")
    
main()
    
    
    
