import tkinter as tk
import random
#----------------------------------------나라별음식리스트
kf = [
    "비빔밥","김치볶음밥","제육덮밥","오징어덮밥","소고기덮밥","김밥","주먹밥","쌈밥","돌솥밥","떡갈비","곰국",'전병',
    "김치찌개","된장찌개","순두부찌개","부대찌개","청국장","갈비탕","설렁탕","삼계탕","감자탕","육개장","동태찌개","알탕","미역국",
    "물냉면","비빔냉면","칼국수","잔치국수","콩국수","잡채","떡만둣국",
    "불고기","제육볶음","삼겹살 구이","닭갈비","오리불고기","고등어구이","꼼장어구이",
    "갈비찜","찜닭","아귀찜","보쌈","족발","장조림","곱창","막창","소고기"
    "떡볶이","닭강정","간장게장","순대볶음","치킨","순대국밥","돼지국밥","선지해장국"
]
cf = [
    "짜장면","짬뽕","간짜장","쟁반짜장","삼선짬뽕","고추짬뽕","굴짬뽕","우육면","탄탄면","울면","기스면","중국식 냉면",
    "볶음밥","새우볶음밥","삼선볶음밥","잡채밥","마파두부밥","유산슬밥","잡탕밥","고추잡채밥",
    "탕수육","꿔바로우","사천 탕수육","동파육","경장육사","난자완스","라조육",
    "깐풍기","유린기","라조기","궁보계정",
    "깐쇼새우","크림새우","칠리새우","유산슬","팔보채","양장피","해물누룽지탕","전가복","어향동고",
    "마파두부","고추잡채","부추잡채","어향가지","오향장육","해파리냉채",
    "군만두","물만두","멘보샤","춘권"
]
wf = [
    "알리오 올리오","봉골레 파스타","까르보나라","새우 크림 파스타","토마토 스파게티","아라비아따","로제 파스타","라자냐","바질 페스토 파스타","명란 파스타","투움바 파스타",
    "마르게리따 피자","페퍼로니 피자","고르곤졸라 피자","콤비네이션 피자","포테이토 피자","하와이안 피자","콰트로 포르마지 피자","디아볼라 피자",
    "안심 스테이크","등심 스테이크","채끝 스테이크","티본 스테이크","함박 스테이크","폭립",
    "버섯 크림 리조또","해산물 토마토 리조또","먹물 리조또","김치 필라프","새우 필라프","시저 샐러드","카프레제 샐러드","리코타 치즈 샐러드","콥 샐러드","연어 샐러드",
    "클럽 샌드위치","BLT 샌드위치","치즈버거","에그 베네딕트","프렌치 토스트","잠봉뵈르",
    "양송이 수프","단호박 수프","어니언 수프","감바스 알 아히요","피쉬 앤 칩스","비프 스트로가노프","맥 앤 치즈",
    "버섯 크림 리조또","베이컨 크림 리조또","닭고기 크림 리조또","새우 크림 리조또","고르곤졸라 크림 리조또","단호박 크림 리조또","고구마 크림 리조또","명란 크림 리조또",
    "스테이크 크림 리조또","해산물 토마토 리조또","치킨 토마토 리조또","아라비아따 리조또","뽀모도로 리조또","로제 리조또","새우 로제 리조또","게살 로제 리조또",
    "치킨 로제 리조또","오징어 먹물 리조또","전복 리조또","바질 페스토 리조또","김치 리조또","된장 크림 리조또","들깨 크림 리조또","새우 필라프","목살 필라프","김치 필라프","치킨 필라프"
]
jf = [
    "모듬초밥","광어초밥","연어초밥","참치초밥","새우초밥","장어초밥","계란초밥","유부초밥",
    "모듬회","연어회","후토마끼","가츠동","에비동","규동","오야꼬동","사케동 (연어덮밥)","우나동 (장어덮밥)","텐동 (튀김덮밥)","부타동 (돼지고기덮밥)",
    "돈코츠라멘","미소라멘","소유라멘","시오라멘","탄탄멘","츠케멘",
    "우동","카레우동","야끼우동","냉모밀 (자루소바)","마제소바","야끼소바",
    "돈까스","치즈돈까스","생선까스","모듬튀김 (덴푸라)","새우튀김 (에비후라이)","치킨 가라아게","고로케","규카츠",
    "메로구이","고등어 소금구이","야키토리 (닭꼬치)","타코야끼",
    "스키야키","밀푀유나베","오뎅탕","창코나베",
    "일본식 카레","하이라이스","오코노미야키","낫토"
]

global result
#----------------------------------------음시선택

def fdresult(result):
    result_lb.config(
        text=result
    )
    
    
def kfbt():
    result = random.choice(kf)
    fdresult(result)
    

def cfbt():
    result = random.choice(cf)
    fdresult(result)


def jfbt():
    result = random.choice(jf)
    fdresult(result)

def wfbt():
    result = random.choice(wf)
    fdresult(result)

def rdbt():
    country = random.randrange(1,5)
    if country == 1:
        result = random.choice(kf)
    if country == 2:
        result = random.choice(cf)
    if country == 3:
        result = random.choice(wf)
    if country == 4:
        result = random.choice(jf)
        
    fdresult(result)
#----------------------------------------tkinter 정의
window = tk.Tk()
window.title("식사메뉴 추천")
window.geometry("500x500")
window.resizable(False, False)

title_lb = tk.Label(
    window,
    text="메뉴추천",
    font=("Malgun Gothic", 40),
    pady=20
)

result_lb = tk.Label(
    window,
    text="결과",
    pady=20,
    height=4
)
#----------------------------------------버튼
kf_bt = tk.Button(
    window,
    text="한식",
    command=kfbt,
    width=15,
    height=2
)

cf_bt = tk.Button(
    window,
    text="중식",
    command=cfbt,
    width=15,
    height=2
)

    
jf_bt = tk.Button(
    window,
    text="일식",
    command=jfbt,
    width=15,
    height=2
)

wf_bt = tk.Button(
    window,
    text="양식",
    command=wfbt,
    width=15,
    height=2
)


rd_bt = tk.Button(
    window,
    text="랜덤",
    command=rdbt,
    width=15,
    height=2
)

#----------------------------------------배치

title_lb.pack()
result_lb.pack()
kf_bt.pack()
cf_bt.pack()
wf_bt.pack()
jf_bt.pack()
rd_bt.pack()

window.mainloop()



