
# -*- coding: utf-8 -*-
keyboard_map = {
    "q": "ض", "w": "ص", "e": "ث", "r": "ق", "t": "ف", "y": "غ", "u": "ع", "i": "ه", "o": "خ", "p": "ح", "[": "ج", "]": "چ",
    "a": "ش", "s": "س", "d": "ی", "f": "ب", "g": "ل", "h": "ا", "j": "ت", "k": "ن", "l": "م", ";": "ک", "'": "گ",
    "z": "ظ", "x": "ط", "c": "ز", "v": "ر", "b": "ذ", "n": "د", "m": "پ", ",": "و", ".": ".", "/": "/",
    "Q": "َ", "W": "ً", "E": "ُ", "R": "ِ", "T": "ّ", "Y": "ٍ", "U": "ء", "I": "آ", "O": "ـ", "P": "«", "{": "»", "}": "؛",
    "A": "أ", "S": "ص", "D": "ي", "F": "إ", "G": "آ", "H": "آ", "J": "ة", "K": "ك", "L": "م", ":": "ك", """: "گ",
    "Z": "ژ", "X": "ط", "C": "ژ", "V": "ر", "B": "ذ", "N": "د", "M": "پ", "<": "و", ">": "؟"
}

def convert_text(text):
    return "".join(keyboard_map.get(ch, ch) for ch in text)

if __name__ == "__main__":
    print("لطفاً متن قاطی رو وارد کن (ورود خالی برای خروج):")
    while True:
        raw = input("> ")
        if not raw.strip():
            break
        print(convert_text(raw))
