import os
import time
import sys
import shutil
#просто импорты 

title = "Inpentium СLIENT BETA"
# тут итак все понятно 
print(" LANCKIN ") 

#СКРЫТИЕ ЭТОЙ СТРОКИ НЕ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ @frozik12 НА ОСНОВЕ ЛОУДЕРА Windy client (P.s. слздатель лоудер для windy frozik) ") #СКРЫТИЕ ЭТОЙ СТРОКИ НЕ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА


#os.system("files\\funpay.bat") 
# при жилании можно убрать запуск файла funpay.bat с коментирования (там мой фан пец можете заменить на свой просто написать в батнике start <<ccылка на фанпей>> и указать до него путь лучше пихать в папку files
#shutil.rmtree("C:\Nurik")
#данная страка удаляет папку Nurik с C:\ советую уберать с коментирования 
time.sleep(3)
os.system('cls' if os.name == 'nt' else 'clear')
#time.sleep(3) значит что после запуска через 1 секунду запуститься лоудер подробнее тут > https://docs.python.org/3/library/time.html <


print("                ██╗███╗░░██╗██████╗░███████╗███╗░░██╗████████╗██╗██╗░░░██╗███╗░░░███╗")
print("                ██║████╗░██║██╔══██╗██╔════╝████╗░██║╚══██╔══╝██║██║░░░██║████╗░████║")
print("                ██║██╔██╗██║██████╔╝█████╗░░██╔██╗██║░░░██║░░░██║██║░░░██║██╔████╔██║")
print("                ██║██║╚████║██╔═══╝░██╔══╝░░██║╚████║░░░██║░░░██║██║░░░██║██║╚██╔╝██║")
print("                ██║██║░╚███║██║░░░░░███████╗██║░╚███║░░░██║░░░██║╚██████╔╝██║░╚═╝░██║")
print("                ╚═╝╚═╝░░╚══╝╚═╝░░░░░╚══════╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░╚═════╝░╚═╝░░░░░╚═╝")

#тут вставляем ваш текст! 
print("                            [+] Inpentium Запускаеться ")
time.sleep(2)
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                ██╗███╗░░██╗██████╗░███████╗███╗░░██╗████████╗██╗██╗░░░██╗███╗░░░███╗")
print("                ██║████╗░██║██╔══██╗██╔════╝████╗░██║╚══██╔══╝██║██║░░░██║████╗░████║")
print("                ██║██╔██╗██║██████╔╝█████╗░░██╔██╗██║░░░██║░░░██║██║░░░██║██╔████╔██║")
print("                ██║██║╚████║██╔═══╝░██╔══╝░░██║╚████║░░░██║░░░██║██║░░░██║██║╚██╔╝██║")
print("                ██║██║░╚███║██║░░░░░███████╗██║░╚███║░░░██║░░░██║╚██████╔╝██║░╚═╝░██║")
print("                ╚═╝╚═╝░░╚══╝╚═╝░░░░░╚══════╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░╚═════╝░╚═╝░░░░░╚═╝")

#тут вставляем ваш текст! 
print("                            [+] Inpentium Запускаеться ")
#my_file = open("TelegramPass.txt", "w+")
#my_file.write(*№&D&AWTT%T!(&^T(^TW^ASTWTGAD&G&*AGW&T!&T#@)_!#*(@*(&_!*&&#!@&%$^^%@%!%@*^&tt*&adastd*tw&da&*awdtt*a pass:#+!#@((#!@)/@) log:#-&@_}{=[+%[] ")
#my_file.close()
#my_file = open("httpsarbuzcc.txt", "w+")
#my_file.write("@&%$^^%@%!%@*^&tt*&adastd*tw&da&*awdtt*a login:-@!@?#)?@;!#(#(*?#()#)#(*+#!!?";*:'znns%][[}{{=\\\/obf")
#my_file.close()
#my_file = open("DiscordKey.txt", "w+")
#my_file.write("openlog:$-@-&#-(#?!"!;]%}=\[] appdata +;*;*:'sf discord +"!(#)( runtime")
# строка выше это то что будет писаться в файле можете не бояться это просто пустышки можете их вырещать с кода 
#my_file.close()
#ради пранка над другом можете цбрать с коментирования и там где ваш жруг будет запускать файл там будут создаваться эти файлы (просто пустышки) 
# !!! ЛУЧШЕ НЕ ВСТАВЛЯЙТЕ В СВОЙ КЛИЕНТ Т. К. МОЖЕТЕ ПОТЕРЧТЬ РЕПУТАЦИЮ
print("                            ")
print("█▀ ▄▄ ▀█") 
print("█▄ ░░ ▄█")
time.sleep(1) 
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                ██╗███╗░░██╗██████╗░███████╗███╗░░██╗████████╗██╗██╗░░░██╗███╗░░░███╗")
print("                ██║████╗░██║██╔══██╗██╔════╝████╗░██║╚══██╔══╝██║██║░░░██║████╗░████║")
print("                ██║██╔██╗██║██████╔╝█████╗░░██╔██╗██║░░░██║░░░██║██║░░░██║██╔████╔██║")
print("                ██║██║╚████║██╔═══╝░██╔══╝░░██║╚████║░░░██║░░░██║██║░░░██║██║╚██╔╝██║")
print("                ██║██║░╚███║██║░░░░░███████╗██║░╚███║░░░██║░░░██║╚██████╔╝██║░╚═╝░██║")
print("                ╚═╝╚═╝░░╚══╝╚═╝░░░░░╚══════╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░╚═════╝░╚═╝░░░░░╚═╝")

#тут вставляем ваш текст! 
print("                            [+] Inpentium Запускаеться ")
print("                            ")
print("█▀ ▄▄ ▄▄ ▀█") 
print("█▄ ░░ ░░ ▄█") 
time.sleep(1) 
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                ██╗███╗░░██╗██████╗░███████╗███╗░░██╗████████╗██╗██╗░░░██╗███╗░░░███╗")
print("                ██║████╗░██║██╔══██╗██╔════╝████╗░██║╚══██╔══╝██║██║░░░██║████╗░████║")
print("                ██║██╔██╗██║██████╔╝█████╗░░██╔██╗██║░░░██║░░░██║██║░░░██║██╔████╔██║")
print("                ██║██║╚████║██╔═══╝░██╔══╝░░██║╚████║░░░██║░░░██║██║░░░██║██║╚██╔╝██║")
print("                ██║██║░╚███║██║░░░░░███████╗██║░╚███║░░░██║░░░██║╚██████╔╝██║░╚═╝░██║")
print("                ╚═╝╚═╝░░╚══╝╚═╝░░░░░╚══════╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░╚═════╝░╚═╝░░░░░╚═╝")

#тут вставляем ваш текст! 
print("                            [+] Inpentium Запускаеться ")
print("                            ")
print("█▀ ▄▄ ▄▄ ▄▄ ▀█") 
print("█▄ ░░ ░░ ░░ ▄█") 
time.sleep(1) 
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                ██╗███╗░░██╗██████╗░███████╗███╗░░██╗████████╗██╗██╗░░░██╗███╗░░░███╗")
print("                ██║████╗░██║██╔══██╗██╔════╝████╗░██║╚══██╔══╝██║██║░░░██║████╗░████║")
print("                ██║██╔██╗██║██████╔╝█████╗░░██╔██╗██║░░░██║░░░██║██║░░░██║██╔████╔██║")
print("                ██║██║╚████║██╔═══╝░██╔══╝░░██║╚████║░░░██║░░░██║██║░░░██║██║╚██╔╝██║")
print("                ██║██║░╚███║██║░░░░░███████╗██║░╚███║░░░██║░░░██║╚██████╔╝██║░╚═╝░██║")
print("                ╚═╝╚═╝░░╚══╝╚═╝░░░░░╚══════╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░╚═════╝░╚═╝░░░░░╚═╝")

#тут вставляем ваш текст! 
print("                            [+] Inpentium Запускаеться ")
time.sleep(2) 
print(" LANCKIN HAHAHAHAHA ") #СКРЫТИЕ ЭТОЙ СТРОКИ НЕ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
time.sleep(2) 
os.system('cls' if os.name == 'nt' else 'clear')
os.system("java -noverify -Xmx2048M -Djava.library.path=.\natives;.\ -cp .\client.jar net.minecraft.client.main.Main --username %Nick% User43 854 --height 480 --version Optifine --gameDir C:\Minecraft\game --assetsDir .\assets --assetIndex 1.16 --uuid N/A --accessToken 0 --userType mojang") 
#↑↑ Строка запуска ↑↑
shutil.rmtree("logs")
#строка выше удаление папки logs после выхода P. s. кто то в коментах просил это зделать 
time.sleep(3) 
sys.exit