questions = [
    {
        "type": "text_image",
        "question": "या ब्लॉकचे काय होईल?",
        "question_image": "images/grade5/ques1.png",
        "options": [
            "या ब्लॉकमध्ये ask ब्लॉक साठवल्यानंतर कीबोडवद्वारे उत्तर देईल.",
            "कोणत्याही प्रश्नाचे  योग्य उत्तर सांगेल.",
            "जेव्हा message 1 इव्हेंट म्हणून प्राप्त होतो तेव्हा स्प्राईट प्रोग्राम चालवेल.",
            "स्प्राईट स्पीच बबलमध्ये उत्तर देईल."
        ],
        "answer": 0
    },
    {
        "type": "text_image",
        "question": "ब्लॉक  वर क्लिक केल्यावर काय होईल?",
        "question_image": "images/grade5/ques2.png",
        "options": [
            "स्प्राइट 1 सेकंदासाठी “I am going up” म्हणेल  ",
            "स्प्राईट बदकाचा आवाज प्ले करेल",
            "स्प्राईट ५० पाऊले पुढे जाईल",
            "स्प्राईट उजवीकडे वळेल"
        ],
        "answer": 0
    },
    {
        "type": "text_image",
        "question": "या ब्लॉक चे काय होईल?",
        "question_image": "images/grade5/ques3.png",
        "options": [
            " हे प्रोजेक्ट मधील सर्व स्क्रिप्ट चालठवणे थांबवतील.",
            "स्प्राइट हलणे थांबवेल",
            "हे फक्त स्प्राईट मध्ये स्क्रिप्ट चालवणे थांबवतील.",
            "कॉम्प्युटर काम करणे थांबवेल"
        ],
        "answer": 0
    },
    {
        "type": "text",
        "question": "योग्य क्रमाने दिलेल्या सूचनांना ________ म्हणतात.",
        "options": ["पप्पू ", "अल्गोरिदम", "सेक़्वेन्स", "प्रोग्राम"],
        "answer": 3
    },
    {
        "type": "text_image",
        "question": "खालील सूचना दिल्यावर स्प्राइटचे काय करेल?",
        "question_image": "images/grade5/ques5.png",
        "options": [
            "स्प्राईट उजव्या दिशेने वळेल आणि म्हणेल, “My name is Penguin”, पॉप आवाज वाजेल आणि ५० पावले पुढे जाणार",
            "स्प्राईट वरच्या दिशेने तोंड करेल, पॉप असा आवाज करेल आणि म्हणेल 'My name is Penguin' आणि ५० पावले पुढे जाईल",
            "स्प्राइट पॉप असा आवाज करेल, आणि वरच्या दिशेने तोंड करेल आणि म्हणेल 'My name is Penguin' आणि ५० पावले पुढे जाईल",
            "'स्प्राईट म्हणेल 'My name is Penguin', पॉप साउंड प्ले करेल, वरच्या दिशेने तोंड करेल आणि ५० पावले पुढे जाईल"
        ],
        "answer": 0
    },
    {
        "type": "text_image_options",
        "question": "स्टेजवर तुमच्याकडे इंग्रजी वर्णमाला आहे. तुम्हाला  स्प्राइटचा पोशाख बदलण्यासाठी, अक्षरांचा आवाज वाजवण्यासाठी आणि सर्व स्प्राइटचा पोशाख बदलण्यासाठी प्रत्येक अक्षरासाठी प्रोग्राम लिहायचा आहे. दिलेला प्रोग्राम चालवण्यासाठी तुम्ही खालीलपैकी कोणता इवेन्ट निवडाल?",
        "question_image": "images/grade5/ques6.png",
        "options": [
            "images/grade5/ques6_opt1.png",
            "images/grade5/ques6_opt2.png",
            "images/grade5/ques6_opt3.png",
            "images/grade5/ques6_opt4.png"
        ],
        "answer": 0
    },
  {
        "type": "text_image",
        "question": "म्युझिक प्लेअर मध्ये दोन गाणी आहेत. कीबोर्डवरील १ आणि २  क्रमांक दाबून वापरकर्त्याद्वारे गाणी वाजवली जाऊ शकतात.  स्पेसबार दाबून वाजवले जाणारे गाणे थांबवता येते. खालील स्क्रिप्ट कार्य करेल का? होय किंवा नाही म्हणा. कारण द्या",
         "question_image": "images/grade5/ques7.png",
        "options": ["हो", "नाही"],
        "answer": 1
    },
    {
        "type": "text",
        "question": "लूप म्हणजे काय?",
        "options": [
            "एकच गोष्ट अनेक वेळा घडणे",
            "गोष्टी/सूचना योग्य क्रमाने घडणे ",
            "संपूर्ण कोडमधील कनेक्शन शोधणे आणि जटिलता कमी करण्यासाठी आवश्यक घटक ओळखणे.",
            "यश मिळविण्यात अडचण किंवा विलंब होऊनही एखादी गोष्ट करण्यात चिकाटी"
        ],
        "answer": 0
    },
    #this is incorrect
    {
        "type": "text_image_options",
        "question": "आपल्याला चित्रामध्ये दिलेल्या मापांसह स्टेजवर आयात बनवायचा आहे. तुम्ही खालीलपैकी कोणत्या सूचना वापराल?",
        "question_image": "images/grade5/ques9.png",
       "options": [
            "images/grade5/ques9_opt1.png",
            "images/grade5/ques9_opt2.png",
            "images/grade5/ques9_opt3.png",
            "images/grade5/ques9_opt4.png"
        ],
        "answer": 0
    },
    #this is incorrect
    {
       "type": "text_image_options",
        "question": "आपल्याला एक प्रोजेक्ट तयार करायचा आहे ज्यामध्ये कीबोर्डवर बटन दाबल्यावर स्प्राईट चित्रात दाखवल्याप्रमाणे  १५ अंशांवर एकामागून एक चौकोन तयार करतो. चौकोनाचा एक शिरोबिंदू समान आहे. खाली दिलेल्या प्रोग्राम पैकी कोणता प्रोग्राम योग्य आहे?",
        "question_image": "images/grade5/ques10.png",
        "options": [
            "images/grade5/ques10_opt1.png",
            "images/grade5/ques10_opt2.png",
            "images/grade5/ques10_opt3.png",
            "images/grade5/ques10_opt4.png"
        ],
        "answer": 0
    },
    {
        "type": "text_image",
        "question": "आपल्याला एक प्रोजेक्ट बनवायचा आहे जिथे क्रमांक 1 चे बटण की दाबल्यावर स्प्राईट स्नेयर ड्रम (१) २ वेळा वाजवेल आणि नंतर क्रॅश सिम्बल (४) एकदा वाजवेल आणि या सर्व सूचना ३ वेळा रिपीट करा. खाली दिलेला प्रोग्राम चालेल का? होय किंवा नाही मध्ये उत्तर द्या. कारण द्या.",
         "question_image": "images/grade5/ques11.png",
        "options": ["हो", "नाही"],
        "answer": 1
    },
    {
        "type": "text_options_image",
        "question": "जर स्प्राईट निळ्या रंगाला स्पर्श करत असेल तर स्प्राईट उजवीकडे जाण्यासाठी तुम्ही खालीलपैकी कोणता कोड वापराल?",
        "options": [
            "images/grade5/ques12_opt1.png",
            "images/grade5/ques12_opt2.png",
            "images/grade5/ques12_opt3.png",
            "images/grade5/ques12_opt4.png"
        ],
        "answer": 0
    },
    {
        "type": "text_image",
        "question": "खाली दिलेल्या कोडचे खालीलपैकी कोणते बरोबर स्पष्टीकरण आहे?",
        "question_image": "images/grade5/ques13.png",
        "options": [
            "डाउन ॲरो बटन दाबल्यास स्प्राईट स्टेजच्या खालच्या दिशेने सरकेल आणि जर स्प्राइट निळ्या रंगाला स्पर्श करत असेल तर स्प्राइट वरच्या दिशेने जाईल.",
            "डाउन ॲरो बटन दाबल्यास स्प्राइट स्टेजच्या वर जाईल आणि जर स्प्राईट निळ्या रंगाला स्पर्श करत असेल तर स्प्राइट खाली सरकेल.",
            "डाउन ॲरो बटन दाबल्यास स्प्राइट स्टेजच्या डावीकडे सरकेल आणि जर स्प्राइट निळ्या रंगाला स्पर्श करत असेल तर स्प्राइट उजवीकडे सरकेल.",
            "डाउन ॲरो बटन दाबल्यास स्प्राइट स्टेजच्या उजवीकडे सरकेल आणि जर स्प्राइट निळ्या रंगाला स्पर्श करत असेल तर स्प्राइट डावीकडे सरकेल."
        ],
        "answer": 0
    },
    {
        "type": "text",
        "question": "पॅरालेलिजम म्हणजे काय?",
        "options": [
            "इव्हेंट सुरू करण्यासाठी माहिती पाठवणे आणि प्राप्त करणे",
            "एकाच वेळी अनेक गोष्टी घडतात",
            "एकच गोष्ट अनेक वेळा घडणे",
            "एक गोष्ट ज्यामुळे इतर गोष्टी घडतात"
        ],
        "answer": 1
    },
    {
       "type": "text_options_image",
        "question": "आपल्याला दोन स्प्राइट्स, एक मुलगा आणि मुलगी यांच्यात खाली दाखवल्याप्रमाणे संभाषण तयार करायचे आहे. त्यासाठी तुम्ही खालीलपैकी कोणते पर्यायाचा कोड वापराल?\nमुलगा: How are you?\nमुलगी: I am fine. How are you?",
        "options": [
            "images/grade5/ques15_opt1.png",
            "images/grade5/ques15_opt2.png",
            "images/grade5/ques15_opt3.png",
            "images/grade5/ques15_opt4.png"
        ],
        "answer": 0
    }
]
