MORSE_CODE = {
    'А': '.-....',    '0':'------',
    'Б': '......',    '1':'----.-',
    'В': '-.....',    '2':'-----.',
    'Г': '..-...',    '3':'.-----',
    'Д': '...-..',    '4':'-.----',
    'Е': '....-.',    '5':'--.---',
    'Ё': '.....-',    '6':'---.--',
    'Ж': '..--..',    '7':'-..---',
    'З': '...--.',    '8':'---..-',
    'И': '....--',    '9':'----..',
    'Й': '--....',
    'К': '.--...',    'город':'-....-',
    'Л': '---...',    'район':'-.---.',
    'М': '.---..',    'улица':'-..---',
    'Н': '..---.',    'дом':'..-.--',
    'О': '...---',    'страна':'.-...-',
    'П': '-.-.-.', 
    'Р': '.-.-.-',    'тыс':'-..--.',
    'С': '---.-.',    'млн':'.-.-..',
    'Т': '.-.-..',    'млрд':'.--.--',
    'У': '-.-...', 
    'Ф': '--.-..',    'руб':'--...-',
    'Х': '.--.-.',    'долл':'--..-.',
    'Ц': '..--.-',    'евро':'..-.-.',
    'Ч': '...-.-',    
    'Ш': '..-.--',
    'Щ': '.-.--.', 
    'Ъ': '-.--..',
    'Ы': '-.-.--', 
    'Ь': '-.--.-', 
    'Э': '..----', 
    'Ю': '.----.', 
    'Я': '----..', 
    
    
}

# Обратный словарь для дешифровки
MORSE_CODE_REVERSE = {v: k for k, v in MORSE_CODE.items()}

def encrypt(text):
    return ' '.join(MORSE_CODE.get(char.upper(), '') for char in text)

def decrypt(morse_code):
    return ''.join(MORSE_CODE_REVERSE.get(code, '') for code in morse_code.split())

while True:
    print("\nВыберите действие:")
    print("1. Зашифровать слово")
    print("2. Расшифровать сообщение")
    print("3. Выйти")
    choice = input("Введите номер действия: ")

    if choice == '1':
        word = input("Введите слово для шифровки: ")
        encrypted_word = encrypt(word)
        print("Зашифрованное слово:", encrypted_word)
    elif choice == '2':
        morse_message = input("Введите сообщение на азбуке Морзе для расшифровки: ")
        decrypted_message = decrypt(morse_message)
        print("Расшифрованное сообщение:", decrypted_message)
    elif choice == '3':
        print("Выход из программы.")
        quit()
