# pip install openpyxl

import json
from openpyxl import Workbook
from openpyxl.styles import Font, Border, Side

# путь к файлу
file_path = "data.json"
xlsx_file = "data.xlsx"

# открываем и читаем json
with open(file_path, "r", encoding="utf-8") as f:
    data = json.load(f)

# создаём Excel файл
wb = Workbook()
ws = wb.active
ws.title = 'Data'

area_map = {
    '700002': 'Северо-Западный федеральный округ',
    '700003': 'Центральный федеральный округ',
    '700004': 'Регион: Барнаул',
    '700005': 'Дальневосточный федеральный округ',
    '700006': 'Уральский федеральный округ',
    '700007': 'Приволжский федеральный округ',
    '700008': 'Южный федеральный округ',
    '700009': 'Северо-Кавказский федеральный округ',
    '1932': 'Амурская область',
    '1008': 'Архангельская область',
    '1217': 'Алтайский край',
    '1505': 'Астраханская область',
    '11': 'Барнаул',
    '1817': 'Белгородская область',
    '1828': 'Брянская область',
    '1739': 'Вологодская область',
    '1716': 'Владимирская область',
    '26': 'Воронеж',
    '1844': 'Воронежская область',
    '24': 'Волгоград',
    '1511': 'Волгоградская область',
    '2134': 'Донецкая область',
    '1941': 'Еврейская АО',
    '3': 'Екатеринбург',
    '1192': 'Забайкальский край',
    '2155': 'Запорожская область',
    '96': 'Ижевск',
    '35': 'Иркутск',
    '1124': 'Иркутская область',
    '1754': 'Ивановская область',
    '1943': 'Камчатский край',
    '1661': 'Кировская область',
    '88': 'Казань',
    '1020': 'Калининградская область',
    '1463': 'Кабардино-Балкарская республика',
    '1471': 'Карачаево-Черкесская Республика',
    '1229': 'Кемеровская область',
    '54': 'Красноярск',
    '1146': 'Красноярский край',
    '1308': 'Курганская область',
    '1859': 'Калужская область',
    '1771': 'Костромская область',
    '1880': 'Курская область',
    '53': 'Краснодар',
    '1438': 'Краснодарский край',
    '145': 'Ленинградская область',
    '1890': 'Липецкая область',
    '2173': 'Луганская область',
    '1': 'Москва',
    '2019': 'Московская область',
    '1946': 'Магаданская область',
    '1061': 'Мурманская область',
    '66': 'Нижний Новгород',
    '1679': 'Нижегородская область',
    '1985': 'Ненецкий АО',
    '1051': 'Новгородская область',
    '4': 'Новосибирск',
    '1202': 'Новосибирская область',
    '1563': 'Оренбургская область',
    '68': 'Омск',
    '1249': 'Омская область',
    '1898': 'Орловская область',
    '1948': 'Приморский край',
    '1575': 'Пензенская область',
    '72': 'Пермь',
    '1317': 'Пермский край',
    '1090': 'Псковская область',
    '1118': 'Республика Бурятия',
    '1174': 'Республика Саха (Якутия)',
    '1347': 'Республика Башкортостан',
    '1620': 'Республика Марий Эл',
    '1556': 'Республика Мордовия',
    '1624': 'Республика Татарстан',
    '1077': 'Республика Карелия',
    '1041': 'Республика Коми',
    '1424': 'Республика Дагестан',
    '1434': 'Республика Ингушетия',
    '1475': 'Республика Северная Осетия-Алания',
    '1216': 'Республика Алтай',
    '1169': 'Республика Тыва',
    '1187': 'Республика Хакасия',
    '1704': 'Рязанская область',
    '1422': 'Республика Адыгея',
    '1553': 'Республика Калмыкия',
    '76': 'Ростов-на-Дону',
    '1530': 'Ростовская область',
    '2114': 'Республика Крым',
    '2': 'Санкт-Петербург',
    '1960': 'Сахалинская область',
    '78': 'Самара',
    '1586': 'Самарская область',
    '79': 'Саратов',
    '1596': 'Саратовская область',
    '1481': 'Ставропольский край',
    '1261': 'Свердловская область',
    '1103': 'Смоленская область',
    '212': 'Тольятти',
    '1255': 'Томская область',
    '95': 'Тюмень',
    '1342': 'Тюменская область',
    '1905': 'Тамбовская область',
    '1783': 'Тверская область',
    '1913': 'Тульская область',
    '99': 'Уфа',
    '1646': 'Удмуртская Республика',
    '98': 'Ульяновск',
    '1614': 'Ульяновская область',
    '102': 'Хабаровск',
    '1975': 'Хабаровский край',
    '1368': 'Ханты-Мансийский АО - Югра',
    '2209': 'Херсонская область',
    '1982': 'Чукотский АО',
    '1652': 'Чувашская Республика',
    '1500': 'Чеченская республика',
    '104': 'Челябинск',
    '1384': 'Челябинская область',
    '1414': 'Ямало-Ненецкий АО',
    '112': 'Ярославль',
    '1806': 'Ярославская область'
}

ws.append(['Регион', 'Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'])
ws.freeze_panes = 'A2'
thin_border = Border(left=Side(style='thin'),
                        right=Side(style='thin'),
                        top=Side(style='thin'),
                        bottom=Side(style='thin'))
for cell in ws[1]:
    cell.font = Font(bold=True)
    cell.border = thin_border

ws.column_dimensions['A'].width = 35
ws.column_dimensions['B'].width = 12
ws.column_dimensions['C'].width = 12
ws.column_dimensions['D'].width = 12
ws.column_dimensions['E'].width = 12
ws.column_dimensions['F'].width = 12
ws.column_dimensions['G'].width = 12
ws.column_dimensions['H'].width = 12
ws.column_dimensions['I'].width = 12
ws.column_dimensions['J'].width = 12
ws.column_dimensions['K'].width = 12
ws.column_dimensions['L'].width = 12
ws.column_dimensions['M'].width = 12

for area_id, dat in data.items():
    l = []
    for v in dat['averageExpected']['18'][1:]:
        # v = list(map(lambda x: str(x).replace('.', ','), v))

        #if v[2]:
        #    v[2] = str(v[2]).replace('.', ',')
        v[2] = float(v[2]) if v[2] else 0
        l.append(v[2])

    area_name = area_map[area_id] if area_id in area_map else 'Unkonwn'
    ws.append([area_name] + l)
    # for i, item in enumerate(dat['averageExpected']['18'], start=1):
    #    ws.append([area_id] + dat['averageExpected']['18'])
    #    print(f"{area_id}: {item}")

# сохраняем в файл
wb.save(xlsx_file)

print(f"Данные сохранены в {xlsx_file}")
