import random

# لیست آیتم‌ها و وزن/درصدها
items = [
    ("سافتلن آبی", 4),
    ("سافتلن سبز", 4),
    ("عسل کوچک", 3),
    ("عسل بزرگ", 1),
    ("ژل ماشین ظرفشویی", 6),
    ("بیسکویت کاکائویی", 7),
    ("چای رفاه لاهیجان", 7),
    ("نودل شف هو", 12),
    ("سس گوجه فرنگی بیژن", 9),
    ("عرق نعناع", 9),
    ("مایع لباسشویی اکتیو", 7),
    ("نوشابه", 10),
    ("نقل خرسند", 8),
    ("قرص جرم گیر ماشین لباسشویی 14 عددی", 7),
    ("مایع براق کننده ماشین ظرفشویی", 8),
    ("قرص جرم گیر ماشین ظرفشویی 5 عددی", 8),
    ("قرص ماشین ظرفشویی 28 عددی", 6),
    ("نمک مخصوص ماشین ظرفشویی", 7),
    ("پودر ماشین ظرفشویی", 6),
    ("نودلیت سبزیجات", 12),
    ("نودلیت مرغ", 12),
    ("نودلیت گوشت", 12),
    ("ظرف در بسته", 8),
    ("کنسرو لوبیا", 8),
    ("پوچ", 5),
    ("آبمیوه", 5)
]

# آماده‌سازی لیست برای انتخاب شانسی بر اساس وزن
choices = []
for item, weight in items:
    choices.extend([item] * weight)

# تابع چرخش گردونه
def spin():
    result = random.choice(choices)
    return f'نتیجه: {result}'

# اجرای برنامه
if __name__ == "__main__":
    input("برای چرخش گردونه Enter را بزنید...")
    print(spin())
    input("برای خروج Enter را بزنید...")