hog = input("с0саl?").lower()
if hog in {"да", "ага", "угу", "конечно", "естественно", "безусловно", "разумеется", "верно", "именно", "бесспорно", "долбаеб?", "возможно", "еблан?", "конеш"}:
    print("Ахахахах, ну тогда щас будешь показывать, чему научился)))))))))))))!")
elif hog in {"нет", "Ахахахах, ну тогда щас будешь показывать, чему научился)))))))))))))!"}:
    print("Щас будешь учиться! На колени суко")
elif hog == "пасхалка":
    print("Ооооо, молодец, словил пасхалочку")
else:
    print("Напиши да или нет, 4м0")